//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:	ATACTRL.UNI
//
// Description:	ATA Controller setup string definitions 
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

//<Shanyf-20180920 Enable J27 MINISAS SATA/PCIE switch function +>
//<ChengXW001-20170520 AMD SATA PCIe Switch Configuration +>
#string STR_SATA_PCI_SWITCH_FORM              #language eng "SATA/NVMe Settings"//<Yaosr002-20180609 modify the name>
                                              #language zh-chs "NVMe/SATA 切换"
#string STR_SATA_PCI_SWITCH_HELP              #language eng "This option is used for configuring CPU DXIO to SATA or PCIe interface"
                                              #language zh-chs "该选项用于将CPU DXIO配置为SATA或NVMe接口"

#string STR_SATA_PCI_SWITCH_CONF_FORM         #language eng "NVMe/SATA Switch Configuration"
                                              #language zh-chs "NVMe/SATA 切换配置"
//#string STR_CPU_SOCKET0_DIE1                  #language eng "Cpu0 Die1 Option"
//#string STR_CPU_SOCKET1_DIE0                  #language eng "Cpu1 Die0 Option"
//#string STR_CPU_SOCKET1_DIE1                  #language eng "Cpu1 Die1 Option"

#string STR_CPU_SOCKET0_PORT0                 #language eng "J27 (HDD / U.2_0)"
                                              #language zh-chs "J27（硬盘 /U.2_0）"
#string STR_CPU_SOCKET0_PORT0_HELP            #language eng "SATA or NVMe for J27 (HDD / U.2_0)"
                                              #language zh-chs "J27的SATA或NVMe（硬盘 / U.2_0）"
//#string STR_CPU_SOCKET0_PORT1                 #language eng "J14 (HDD 4- 7/U.2_1)"
//#string STR_CPU_SOCKET0_PORT1_HELP            #language eng "SATA or NVMe for J14 (HDD4-7 / U.2_1)"
//#string STR_CPU_SOCKET1_PORT0                 #language eng "J15 (HDD 8-11/U.2_2)"
//#string STR_CPU_SOCKET1_PORT0_HELP            #language eng "SATA or NVMe for J15 (HDD8-11 / U.2_2)"
//#string STR_CPU_SOCKET1_PORT1                 #language eng "J16 (HDD12-15/U.2_3)"
//#string STR_CPU_SOCKET1_PORT1_HELP            #language eng "SATA or NVMe for J16 (HDD12-15 / U.2_3)"
//#string STR_CPU_SOCKET1_PORT2                 #language eng "J19 (U.2_6)"
//#string STR_CPU_SOCKET1_PORT2_HELP            #language eng "SATA or NVMe for J19 (U.2_6)"
//#string STR_CPU_SOCKET1_PORT3                 #language eng "J20 (U.2_7)"
//#string STR_CPU_SOCKET1_PORT3_HELP            #language eng "SATA or NVMe for J20 (U.2_7)"
//#string STR_CPU_SOCKET1_PORT4                 #language eng "J17 (HDD16-19/U.2_4)"
//#string STR_CPU_SOCKET1_PORT4_HELP            #language eng "SATA or NVMe for J17 (HDD16-19 / U.2_4)"
//#string STR_CPU_SOCKET1_PORT5                 #language eng "J18 (HDD20-23/U.2_5)"
//#string STR_CPU_SOCKET1_PORT5_HELP            #language eng "SATA or NVMe for J18 (HDD20-23 / U.2_5)"

#string STR_PCIE_INTERFACE_TEXT               #language eng "NVMe"
                                              #language zh-chs "NVMe"
#string STR_SATA_INTERFACE_TEXT               #language eng "SATA"
                                              #language zh-chs "SATA"
#string STR_UNUSED_INTERFACE_TEXT             #language eng "Unused"
                                              #language zh-chs "未使用"
//<Kangmm-20190920 Config DXIO by FRU on 52DA16 +>
#string STR_SET_TO_DEFAULT_TEXT               #language eng "SET TO DEFAULT VALUE"
#string STR_TO_VALUE_0_TEXT                   #language eng "SET TO VALUE 0"
#string STR_TO_VALUE_1_TEXT                   #language eng "SET TO VALUE 1"
//<Kangmm-20190920 Config DXIO by FRU on 52DA16 ->
//<ChengXW001-20170520 AMD SATA PCIe Switch Configuration ->
//<Shanyf-20180920 Enable J27 MINISAS SATA/PCIE switch function ->

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2008, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
